app/controllers/documentary_controller.rb

SELECT "documentaries".* FROM "documentaries"
---
  def index
    @documentaryall = Documentary.all

INSERT INTO "documentaries" ("name", "synopsis", "director", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @documentary = Documentary.new(documentary_params)
    if @documentary.save