app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("name", "synopsis", "director", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"