app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "movies".* FROM "movies"
SELECT "series".* FROM "series"
SELECT "documentaries".* FROM "documentaries"
---
  def index
      @posts = Post.all
      @movies = Movie.all
      @series = Series.all
      @documentaries = Documentary.all

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Titulo 1"], ["content", "Nuevo contenido"], ["created_at", "2024-09-27 06:01:17.693690"], ["updated_at", "2024-09-27 06:01:17.693690"]]
---
  def create
    @post = Post.new(posts_params)

    if @post.save