app/controllers/series_controller.rb

  def index
    @seriesall = Series.all
---
SELECT "series".* FROM "series"

  def create
    @series = Series.new(serie_params)
    if @series.save
---
INSERT INTO "series" ("name", "synopsis", "director", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"